项目源码/企业端/qiye/app/controllers/categories_controller.rb

  def index
    @categories = Category.paginate(page: params[:page], per_page: 10).order(updated_at: :desc)
---
SELECT  `categories`.* FROM `categories` ORDER BY `categories`.`updated_at` DESC LIMIT 10 OFFSET 0

  def show
    @products = @category.products.paginate(page: params[:page], per_page: 10).order(updated_at: :desc)
---
SELECT  `products`.* FROM `products` WHERE `products`.`category_id` = 1 ORDER BY `products`.`updated_at` DESC LIMIT 10 OFFSET 0

  def create
    params = category_params
    if params['logo']
      filename = generate_filename
      Image.upload(params['logo'].tempfile.path, filename)
      params['logo'] = filename
    end
    @category = Category.new(params)

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('sports shoes', '2017-05-25 23:14:15', '2017-05-25 23:14:15')

  def update
    params = category_params
    if params['logo']
      filename = generate_filename
      Image.upload(params['logo'].tempfile.path, filename)
      params['logo'] = filename
    end

    respond_to do |format|
      if @category.update(params)
---
UPDATE `categories` SET `logo` = 'category-1495798600898', `updated_at` = '2017-05-26 04:36:42' WHERE `categories`.`id` = 1

  def prices
    @prices = @category.prices.paginate(page: params[:page], per_page: 10)
---
SELECT  `prices`.* FROM `prices` INNER JOIN `products` ON `prices`.`product_id` = `products`.`id` WHERE `products`.`category_id` = 1 LIMIT 10 OFFSET 0

  def init_prices
    @category.products.each do |product|
      product.create_price unless product.price
---
SELECT `products`.* FROM `products` WHERE `products`.`category_id` = 1
INSERT INTO `prices` (`product_id`, `created_at`, `updated_at`) VALUES (1, '2017-05-25 23:23:43', '2017-05-25 23:23:43')

    def set_category
      @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1