项目源码/企业端/qiye/app/controllers/coupons_controller.rb

  def create
    @coupon = @user.coupons.create(coupon_params)
---
INSERT INTO `coupons` (`coupon_list_id`, `user_id`, `valid_from`, `valid_to`, `created_at`, `updated_at`) VALUES (1, 1, '2017-05-26', '2017-05-31', '2017-05-26 01:35:27', '2017-05-26 01:35:27')

  def set_user
    @user = User.find(params[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1