项目源码/企业端/qiye/app/controllers/couriers_controller.rb

  def index
    @couriers = Courier.paginate(page: params[:page], per_page: 10).order(updated_at: :desc)
---
SELECT  `couriers`.* FROM `couriers` ORDER BY `couriers`.`updated_at` DESC LIMIT 10 OFFSET 0