项目源码/企业端/qiye/app/controllers/factories_controller.rb

  def index
    @factories = Factory.paginate(page: params[:page], per_page: 10).order(updated_at: :desc)
---
SELECT  `factories`.* FROM `factories` ORDER BY `factories`.`updated_at` DESC LIMIT 10 OFFSET 0