项目源码/企业端/qiye/app/controllers/order_promotions_controller.rb

INSERT INTO `order_promotions` (`kind`, `discount`, `premise`, `coupon_list_id`, `created_at`, `updated_at`) VALUES (0, 10.0, 100.0, 1, '2017-05-26 06:04:10', '2017-05-26 06:04:10')
---
  def create
    @order_promotion = @coupon_list.order_promotions.create(resource_params)

SELECT  `coupon_lists`.* FROM `coupon_lists` WHERE `coupon_lists`.`id` = 1 LIMIT 1
---
  def set_coupon_list
    @coupon_list = CouponList.find(params[:coupon_list_id])