项目源码/企业端/qiye/app/controllers/products_controller.rb

  def create
    params = product_params
    if params['logo']
      filename = generate_filename
      Image.upload(params['logo'].tempfile.path, filename)
      params['logo'] = filename
    end
    @product = @category.products.create(product_params)
---
INSERT INTO `products` (`name`, `logo`, `category_id`, `created_at`, `updated_at`) VALUES ('jogging shoes', '', 1, '2017-05-25 23:18:16', '2017-05-25 23:18:16')

  def update
    params = product_params
    if params['logo']
      filename = generate_filename
      Image.upload(params['logo'].tempfile.path, filename)
      params['logo'] = filename
    end
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `logo` = '#<ActionDispatch::Http::UploadedFile:0x007fef8d696250>', `updated_at` = '2017-05-26 04:37:47' WHERE `products`.`id` = 4

    def set_category
      @category = Category.find(params[:category_id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

    def set_product
      @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1