项目源码/企业端/qiye/app/controllers/promotion_rules_controller.rb

INSERT INTO `cities_promotion_rules` (`city_id`, `promotion_rule_id`, `created_at`, `updated_at`) VALUES (1, 1, '2017-05-26 01:57:54', '2017-05-26 01:57:54')
INSERT INTO `promotion_rules` (`coupon_list_id`, `start_on`, `end_on`, `created_at`, `updated_at`) VALUES (1, '2017-05-26', '2017-05-31', '2017-05-26 01:57:54', '2017-05-26 01:57:54')
---
  def create
    @promotion_rule = @coupon_list.promotion_rules.create(resource_params)

SELECT  `coupon_lists`.* FROM `coupon_lists` WHERE `coupon_lists`.`id` = 1 LIMIT 1
---
  def set_coupon_list
    @coupon_list = CouponList.find(params[:coupon_list_id])