项目源码/企业端/qiye/app/controllers/roles_controller.rb

SELECT  `roles`.* FROM `roles` ORDER BY `roles`.`updated_at` DESC LIMIT 10 OFFSET 0
---
  def index
    @roles = Role.paginate(page: params[:page], per_page: 10).order(updated_at: :desc)

INSERT INTO `roles` (`name`, `created_at`, `updated_at`, `display_name`, `comment`) VALUES ('boss', '2017-05-25 23:21:08', '2017-05-25 23:21:08', 'boss', '')
---
  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save

DELETE FROM `roles` WHERE `roles`.`id` = 1
---
  def destroy
    @role.destroy

SELECT  `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1
---
    def set_role
      @role = Role.find(params[:id])