项目源码/企业端/qiye/app/controllers/settlement_rules_controller.rb

SELECT  `settlement_rules`.* FROM `settlement_rules` WHERE `settlement_rules`.`city_id` = 1 ORDER BY `settlement_rules`.`updated_at` DESC LIMIT 10 OFFSET 0
---
  def index
    @settlement_rules = current_city.settlement_rules.paginate(page: params[:page], per_page: 10).order(updated_at: :desc)