项目源码/企业端/qiye/app/controllers/user_card_charge_settings_controller.rb

  def index
    @user_card_charge_settings = UserCardChargeSetting.where(city: current_city).paginate(page: params[:page], per_page: 10).order(updated_at: :desc)
---
SELECT  `user_card_charge_settings`.* FROM `user_card_charge_settings` WHERE `user_card_charge_settings`.`city_id` IS NULL ORDER BY `user_card_charge_settings`.`updated_at` DESC LIMIT 10 OFFSET 0

  def create
    @user_card_charge_setting = UserCardChargeSetting.new(user_card_charge_setting_params)
    @user_card_charge_setting.city_id = current_city.id
    puts "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++"
    puts "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++"
    puts "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++"
    puts "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++"
    puts @user_card_charge_setting.city_id
    respond_to do |format|
      if @user_card_charge_setting.save
---
INSERT INTO `user_card_charge_settings` (`min`, `money_give`, `created_at`, `updated_at`, `city_id`) VALUES (6.0, 1.0, '2017-05-26 01:49:11', '2017-05-26 01:49:11', 1)

  def update
    respond_to do |format|
      if @user_card_charge_setting.update(user_card_charge_setting_params)
---
UPDATE `user_card_charge_settings` SET `min` = 100.0, `updated_at` = '2017-05-26 00:50:56' WHERE `user_card_charge_settings`.`id` = 1

  def destroy
    @user_card_charge_setting.destroy
---
DELETE FROM `user_card_charge_settings` WHERE `user_card_charge_settings`.`id` = 2

    def set_user_card_charge_setting
      @user_card_charge_setting = UserCardChargeSetting.find(params[:id])
---
SELECT  `user_card_charge_settings`.* FROM `user_card_charge_settings` WHERE `user_card_charge_settings`.`id` = 2 LIMIT 1