项目源码/企业端/qiye/app/controllers/user_cards_controller.rb

INSERT INTO `user_card_logs` (`kind`, `real_money`, `fake_money`, `loggable_type`, `loggable_id`, `user_card_id`, `created_at`, `updated_at`) VALUES (1, 8.0, 8.0, 'Worker', 2, 1, '2017-05-25 23:57:31', '2017-05-25 23:57:31')
---
  def charge
    if request.post?
      @user_card_log = UserCardLog.new(user_card_log_params.merge(kind: 1, loggable: current_worker, user_card: @user.user_card))

      respond_to do |format|
        if @user_card_log.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def set_user
    @user = User.find(params[:user_id])

SELECT  `user_cards`.* FROM `user_cards` WHERE `user_cards`.`user_id` = 1 LIMIT 1
---
  def set_user_card
    @user_card = UserCard.find(params[:id])