项目源码/企业端/qiye/app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 10).order(updated_at: :desc)
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`updated_at` DESC LIMIT 10 OFFSET 0

  def show
    @orders = @user.orders.paginate(page: params[:order_page], per_page: 10).order(id: :desc)
    @user_card_logs = @user.user_card.user_card_logs.paginate(page: params[:user_card_log_page], per_page: 10).order(id: :desc)
    @coupons = @user.coupons.paginate(page: params[:coupon_page], per_page: 10).order(id: :desc)
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`user_id` = 1 ORDER BY `orders`.`id` DESC LIMIT 10 OFFSET 0
SELECT  `user_card_logs`.* FROM `user_card_logs` WHERE `user_card_logs`.`user_card_id` = 1 ORDER BY `user_card_logs`.`id` DESC LIMIT 10 OFFSET 0
SELECT  `coupons`.* FROM `coupons` WHERE `coupons`.`user_id` = 1 ORDER BY `coupons`.`id` DESC LIMIT 10 OFFSET 0

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1