项目源码/企业端/qiye/app/controllers/workers_controller.rb

  def index
    @workers = Worker.paginate(page: params[:page], per_page: 10).order(updated_at: :desc)
---
SELECT  `workers`.* FROM `workers` ORDER BY `workers`.`updated_at` DESC LIMIT 10 OFFSET 0

  def create
    @worker = Worker.new(worker_params)

    respond_to do |format|
      if @worker.save
---
INSERT INTO `workers` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('operator@163.com', '$2a$11$aSIDY/b7BCwxU4c0Wf4zbOHF2jtFbNxCUuwLZZWUNGmdL02FdY9Cq', '2017-05-26 02:16:40', '2017-05-26 02:16:40')

    def set_worker
      @worker = Worker.find(params[:id])
---
SELECT  `workers`.* FROM `workers` WHERE `workers`.`id` = 2 ORDER BY `workers`.`id` ASC LIMIT 1