项目源码/企业端/qiye/app/views/workers/index.html.slim

            td
              = worker.roles.map(&:display_name).join(',')
            td
              = worker.cities.map(&:name).join(',')
---
SELECT `roles`.* FROM `roles` INNER JOIN `workers_roles` ON `roles`.`id` = `workers_roles`.`role_id` WHERE `workers_roles`.`worker_id` = 2
SELECT `cities`.* FROM `cities` INNER JOIN `cities_workers` ON `cities`.`id` = `cities_workers`.`city_id` WHERE `cities_workers`.`worker_id` = 2