项目源码/企业端/qiye/app/views/coupon_lists/show.html.slim

SELECT `order_promotions`.* FROM `order_promotions` WHERE `order_promotions`.`coupon_list_id` = 1
---
          tbody
            = render @coupon_list.order_promotions
      .panel-footer