项目源码/企业端/qiye/app/views/layouts/_menu.slim

SELECT  `cities`.* FROM `cities` INNER JOIN `cities_workers` ON `cities`.`id` = `cities_workers`.`city_id` WHERE `cities_workers`.`worker_id` = 2 ORDER BY `cities`.`id` ASC LIMIT 1
---
              ul.dropdown-menu role='menu' aria-labelledby="dropdownMenu1"
                - current_worker.cities.each do |city|