项目源码/企业端/qiye/app/views/categories/show.html.slim

        tbody
          - @category.products.each do |product|
---
SELECT `products`.* FROM `products` WHERE `products`.`category_id` = 1